// 1. Написать фунцкию, которая принимает на вход
//    hex код цвета, а возвращает rgb код

//    #ffffff -> rgb(255, 255, 255);
//    #f5f5f5 -> rgb(245, 245, 245);
//    #873a3a -> rgb(135, 58, 58);

// 2. Написать функцию, которая принимает на вход 3 аргумента
//    red, green и blue, каждый их которых отвечеат за соответсвующий
//    канал цвета, и возвращает hex код типа #ffffff

// 3. Написать функуию, которая может замаскировать номер карты
//    На вход она принимает строку, содержащую номер, а
//    возвращает замаскированную карут

//    4141414141414141 -> 4141 **** **** 4141
//    5168111147864573 -> 5168 **** **** 4573

// Task 1
